# BeginPoly

## Description
Procedures BeginPoly creates a new polygon or polyline object in a VectorWorks document. When used with vertex creation procedure calls, BeginPoly and EndPoly() define the polygon object on a vertex by vertex basis.

A minimum of two vertices must be created, and calculations may be performed within the creation structure between vertex calls, thus allowing additional flexibility in object generation.Hidden edges may be created by using use MoveTo() or Move() between vertex calls.

```pascal
PROCEDURE BeginPoly;
```

```python
def vs.BeginPoly():
    return None
```

## See Also
<listTable indent="1" cols="4">
AddPoint|AddPoint
ArcTo|ArcTo
BeginPoly|BeginPoly
ClosePoly|ClosePoly
CurveThrough|CurveThrough
CurveTo|CurveTo
DelVertex|DelVertex
EndPoly|EndPoly
GetHole|GetHole
GetNumHoles|GetNumHoles
GetPolylineVertex|GetPolylineVertex
GetPolyPt|GetPolyPt
GetVertexVisibility|GetVertexVisibility
GetVertNum|GetVertNum
InsertVertex|InsertVertex
OpenPoly|OpenPoly
Poly|Poly
SetPolylineVertex|SetPolylineVertex
SetPolyPt|SetPolyPt
SetVertexVisibility|SetVertexVisibility
Smooth|Smooth
</listTable>

## Version
Availability: from All Versions

## Category
* Objects - Polys